package task.T1;

public class Task2 {
    public static void main(String[] args) {
        // Ти можеш протестувати метод тут !
        task1(50);
    }

    public static void task1(int age) {
        /*
        Твій друг сказав скільки йому років. Тобі треба дати йому різні відповіді в залежності від кількості років.

        Якщо менше 0: Ти що на приколі? Народися спочатку!
        Якщо менше 18: Підрости трішечки!!
        Якщо від 18 до 45: Ти мабуть чийсь батько чи мати...
        Якщо більше ніж 45: Оо-оой, старюга!
        Якщо 125 або більше: Ти що, привид?!
         */
        System.out.print("Ти що на приколі? Народися спочатку!");
    }

    public static void task2(int age, float money, float price) {
        /*
        Павло хоче купити в магазині пиво.
        В залежності від того чи є йому 18 пиво можуть продати або не продати!
        Також якщо у Павла недостатньо грошей на пиво, йому його не продадуть!

        age - кількість років Павла
        money - скільки грошей в Павла
        price - скільки коштує пиво

        Якщо Павлу менше 18, продавець каже: Вибач, але пиво тільки для дорослих!
        Якщо Павлу 18 або більше років, але недостатньо грошей, продавець каже: Вибач, але в тебе недостатньо грошей!
        Якщо Павлу 18 та вистачає грошей, продавець каже: Пригощайся!
         */
        System.out.print("Пригощайся!");
    }

    public static void task3(int number1, int number2, String answerOfBrother) {
        /*
        Ти допомагаєш молодшому братику з домашнім завданням. Йому треба навчитися порівнювати два числа.
        answerOfBrother - відповідь братика. Він може сказати наступне:
            1. Числа рівні/
            2. Перше число більше
            3. Друге число більше

        Перевір чи відповідь твого братика вірна.
            Якщо він вгадав, напиши в консоль: Молодець, братику!
            Якщо він не вгадав, напиши в консоль: Ти помилився, правильна відповідь - {Правильна відповідь}

        Варіанти відповідей:
            1. Якщо два числа рівні: Числа рівні
            2. Якщо перше число більше за друге: Перше число більше
            3. Якщо друге число більше за друге: Друге число більше
         */
    }

}
