package task.T1;

public class Task1 {
    public static void main(String[] args) {
        // Ти можеш протестувати метод тут !
        firstTask();
        secondTask(2, 5);
    }

    public static void firstTask() {
        /*
            Програма має виводити в консоль "Це моє перше завдання!" одним рядком
         */

    }

    public static void secondTask(int number1, int number2) {
        /*
            Цей метод приймає два числа number1 та number2! Ці числа можуть бути різними!

            Створи програму, яка виводить суму цих чисел у наступному вигляді:
            Наприклад, якщо перше число - 2, а друге число - 5, то треба вивести:
            Сума: 2 + 5 = 7
         */

    }

    public static void thirdTask(float number1, float number2) {
        /*
            Ти отримуєш два числа number1 та number2. Тобі треба поділити number1 на number2.

            Зауваження! number1 та number2 не повинні мати нецілу частину.
            Результат ділення повинен після коми мати не більше двох знаків

            Приклад для number1 = 10, number2 = 3:
            10 поділити на 3 дорівнює 3.33
         */

    }

    public static void fourthTask(float day) {
        /*
            Ти отримуєш аргумент day, який показує сьогоднішній день відносно початку року.
            Тобі треба визначити скільки днів до кінця року залишилося (не враховуємо високосний рік)

            Приклад виводу для number = 354:
            До кінця року залишилося 10 днів!
         */

    }

    public static void power(float number) {
        /*
            Метод знаходить квадратний степінь числа number та виводить в консоль у форматі:

            Приклад для number=2.2
            Степінь числа 2.2 = 4.84
         */


    }
}
