package task.T6;

// Конструктор - це спеціальний метод, який використовується для ініціалізації класу (об'єкту)
// Ініціалізації - процес підготовки чогось щоб з ним можна було працювати
class Human {
    String name;
    int age;

    /*
        Створення конструктора.
        Конструктор завжди належить певному класу.
        Конструктор нічого не повертає. Функція повинна повертати щось (навіть якщо нічого - void)
    */
    Human() {

    }

    void info() {
        System.out.printf("Ім'я: %s, Вік: %d\n", name, age);
    }
}