package task.Т11;

public class Person {
    // ООП - об'єктно-орієнтоване програмування
    // Складається з 4 основних правил: інкапсуляція, наслідування, абстракція,
    // SOLID
    // KISS
    // DRY

    /* Інкапсуляція (Encapsulation) - механізм взаємодії між об'єктами,
        який дозволяє приховувати внутрішню реалізацію від зовнішнього світу
        та дозволяє обмежувати доступ до даних (класів/методів/полів)

        Приклади в Java: використання модифікаторів доступу (public/private/protected/default)
     */

}
