package task.T2;

import java.util.Scanner;

public class Loops {
    public static void main(String[] args) {

    }

    public static void task1 () {
        /*
            Вчитель сказав порахувати від 1 до 100. Створи програму яка буде це робити!
            Приклад:
            1
            2
            3
            ...
            100
         */
    }

    public static void task2 () {
        /*
            Вчителю дуже сподобалось як ти рахуєш від 1 до 100 і тепер він хоче щоб ти порахував від 100 до 1!
            Створи програму яка буде це робити!
            Приклад:
            100
            99
            98
            ...
            1
         */
    }

    public static void task3 () {
        /*
            Вчителю в захваті! Ти вмієш рахувати і від 1 до 100 і від 100 до 1.
            Він настільки тішиться, що просить тебе рахувати від 1 до 100, а потім від 100 до 1 і так нескінчено!

            Створи програму яка буде це робити!
            Приклад:
            1
            2
            ...
            100
            99
            ...
            1
            2
            ...
         */
    }

    public static void task4 (int n) {
        /*
            Порахуй за допомогою циклу числа від 1 до n і виведи в консоль.
            Якщо n = 0, виведи 0.
            Якщо n < 0, виведи "Суми не існує"
         */
    }

    public static int task5 (int n) {
        /*
            Важливо!
                - В цьому завданні не використовуємо вивід в консоль.
                - Щоб виконати це завдання, просто замість return -1 підставте потрібне значення

            Напишіть метод, який обчислює факторіал числа n і повертає його значення.
            Факторіал числа n (позначається n!) визначається як добуток всіх цілих чисел від 1 до n, включно.

            Наприклад:
                5! = 5 × 4 × 3 × 2 × 1 = 120
                0! = 1 (за визначенням факторіалу)
        */
        return -1;
    }

    public static void task6 () {
        /*
            Зверни увагу! В цьому завданні немає тестів.

            Створи програму, яка приймає від користувача два числа (Використовуй Scanner).
                - Якщо ці числа різні, програма їх віднімає.
                - Якщо вони рівні, додай їх.
                - Якщо користувач вводить рядок, а не число - просто виведи те що ввів користувач.
                - Якщо одне з чисел є нулем, програма закінчується

            Важливо! Програма не повинна закінчуватись після введення чисел (закінчується тільки коли вводять 0)

            Приклад:
            Введення: 1 2 | Вивід: -1
            Введення: 1 1 | Вивід: 2
            Введення: 1 "Я красивий" | Вивід: "1 Я красивий"
            Введення: 1 0 | Програма закінчилась
         */
    }


}
