package task.T33;

public class Main {
    public static void main(String[] args) {
        // immutable - незмінний
        // mutable - змінний

        /*Вимоги immutable класу:
        1. Має бути оголошений як final, щоб від нього не можна було успадковуватися. Інакше дочірні класи можуть порушити незмінність
        2. Усі поля класу мають бути private відповідно до принципів інкапсуляції
        3. Для виключення можливості змінити стан після ініціалізації об'єкту незмінного класу не повинно бути сетерів
        4. Для коректного створення незмінного класу,
            такий клас повинен мати параметризовані конструктори (конструктори з параметрами), якими здійснюється ініціалізація незмінного об'єкта
        5. Для полів-колекцій (масивів, для безпеки з посиланнями) необхідно робити глибокі копії, щоб гарантувати незмінність
         */
        // ArrayList - Динамічний масив
    }
}
