package task.T1.review;

public class Task1 {
    public static void main(String[] args) {

    }

    public static void numberIncreasing(String number) {
        /*
            Ти отримуєш число number, треба повернути в консоль: "Твоє нове число: {number + 1}", але для від'ємні числа не збільшуй!

            Наприклад, якщо число number - 15, треба вивести: "Твоє нове число: 16"

            Підказка: викорстовуй для перетворення Integer.parseInt(number)
         */
    }

    public static void numberChecking(int number) {
        /*
            Є число і тобі треба перевірити чи воно щасливе! Щасливі числа - парні числа.
            Тому якщо число парне - виведи в консоль "Я тебе вітаю!"
            Інакше - виведи "Ти програв, хочеш спробувати ще?"

            Примітка: Реалізуй це завдання двома способами
                          1. Умовні конструкції (if, else if, else)
                          2. Тернарні оператори (True/False ? value1 : value2
         */
    }

    public static void youngSister(String questionOfSister) {
        /*
            Твоя молодша сестра просить у мами не йти в школу. Але дуже важливо як вона просить!

            Реалізуй наступне:
                - Якщо сестра просить: "Можна, будь-ласка, не йти в школу?", виведи "Можна!"
                - Якщо сестра просить: "Можна не йти в школу сьогодні?", виведи "А чарівне слово?"
                - Якщо сестра просить: "Мам, можна прогуляти школу?", виведи "Не сьогодні!"
                - В інших випадках, мама не розуміє що сестра питає, виведи: "Не зрозуміла, можеш повторити?"
         */
    }

    public static void square(int a, String measure) {
        /*
            Порахуй і виведи периметр та площу квадрата для сторони a. Зверни увагу, що measure може бути мм, см, дм

            Приклад для a = 3, measure - см: "Периметр - 12 см, Площа - 9 см"
            Приклад для a = 1, measure - дм: "Периметр - 4 дм, Площа - 1 дм"

            Пам'ятай:
            Периметр - сума всіх сторін
            Площа - добуток двох сторін
         */
    }

    public static void trafficLight(String color) {
        /*
            Реалізуйте програму для світлофора, яка приймає колір світлофора у вигляді рядка і повертає дію згідно з кольором.
            Параметр:
            - color: колір світлофора ("червоний", "жовтий", "зелений")
            Якщо колір червоний - вивести "Стій".
            Якщо колір жовтий - вивести "Готуйся до руху".
            Якщо колір зелений - вивести "Рухайся".
            Якщо колір не відповідає ні одному з цих варіантів - вивести "Невірний колір".
        */
    }

    public static void calculateSalary(double hoursWorked, double hourlyRate, boolean isWeekends) {
        /*
            Обчислити та вивести зарплату працівника за години роботи. Врахуй що якщо зараз вихідні, працівник отримує 0
            Параметри:
            - hoursWorked: кількість годин, які працівник проробив
            - hourlyRate: скільки працівник отримує за одну годину роботи
            - isWeekends: чи зараз вихідні (true або false)
            Вивести розраховану зарплату з точністю до двох знаків після коми.
        */
    }
}
