package task.T10.packege1;

public class Person1 {
    /* public - означає, що поле, метод, конструктор будуть видимі будь-де
        1. З пакету, де знаходиться сам клас
        2. З будь-якого іншого пакету
     */

    /* private - закритий клас або член класу. Є протилежністю до public.
        Доступний лише з коду того самого класу.

     */

    /*
    protected - захищений.
    - Дозволяє отримати доступ в тому ж пакеті де знаходиться клас.
    - Дозволяє отримати доступ в похідних класах, навіть якщо ці класи знаходяться в інших пакетах.
     */

    /*
    default - не треба вручну писати.
    - Дозволяє отримати доступ в тому ж пакеті де знаходиться клас.
     */
    int age = 33;

    public void playGame() {
        init();
        System.out.println("You are playing!");
        end();
    }

    void init() {
        System.out.println("Start game!");
    }

    void end() {
        System.out.println("End game!");
    }

}
